package com.common.enums;

/**
 * 字典类型
 *
 * @author 抓抓匠
 * @since 2020-07-26
 */
public enum DocTypeEnum {
    QY070("QY070", "价格类型"),
    QY060("QY060", "紧缺货源维护方式"),
    QY069("QY069", "网店状态"),
    QY067("QY067", "返利问题"),
    QY071("QY071", "B2C配送任务单状态"),
    QY073("QY073", "办事处类型"),
    QY072("QY072", "数据类型"),
    QY074("QY074", "来源系统"),
    QY075("QY075", "异型业务类型"),
    QY037("QY037", "业务类型"),
    QY038("QY038", "状态"),
    QY036("QY036", "装修区域"),
    QY039("QY039", "门店状态"),
    QY040("QY040", "账户分配组"),
    QY041("QY041", "导购员类型"),
    QY020("QY020", "性别"),
    QY019("QY019", "联系人类别"),
    QY021("QY021", "注册类型"),
    QY022("QY022", "证件类型"),
    QY023("QY023", "客户一级分类"),
    QY024("QY024", "客户二级分类"),
    QY025("QY025", "所辖市场类别"),
    QY026("QY026", "店铺形态"),
    QY027("QY027", "门店性质"),
    QY028("QY028", "门店类型"),
    QY029("QY029", "门店分类"),
    QY030("QY030", "城市级别"),
    QY031("QY031", "门店级别"),
    QY032("QY032", "口岸类型"),
    QY033("QY033", "分销渠道"),
    QY034("QY034", "账号类型"),
    QY035("QY035", "统驭科目"),
    QY016("QY016", "功能区域"),
    QY015("QY015", "系列类型"),
    QY017("QY017", "产品性质"),
    QY018("QY018", "物料类型"),
    QY044("QY044", "物料层级关系"),
    QY045("QY045", "证件图片类型"),
    QY066("QY066", "新老商家关系"),
    QY065("QY065", "紧缺状态"),
    QY063("QY063", "业务标识"),
    QY068("QY068", "售后问题负责人"),
    QY057("QY057", "分配类型"),
    QY064("QY064", "销售主体"),
    QY002("QY002", "档案状态"),
    QY001("QY001", "产品状态（设计产品）"),
    QY003("QY003", "产品状态（成品）"),
    QY004("QY004", "方向"),
    QY005("QY005", "异型类型"),
    QY006("QY006", "生产模式"),
    QY007("QY007", "通用类型"),
    QY008("QY008", "包装方式"),
    QY062("QY062", "单据类型"),
    QY009("QY009", "产品属性分类"),
    QY010("QY010", "跨工厂物料状态"),
    QY011("QY011", "标签规格"),
    QY012("QY012", "商标"),
    QY013("QY013", "拆洗类型"),
    QY014("QY014", "瓦楞纸板"),
    QY046("QY046", "异型采购申请单单据状态"),
    QY047("QY047", "采购申请单单据状态"),
    QY043("QY043", "活动报名"),
    QY042("QY042", "活动目标"),
    QY048("QY048", "采购订单单据状态"),
    QY049("QY049", "销售业务类型"),
    QY050("QY050", "销售订单"),
    QY051("QY051", "需求类型"),
    QY052("QY052", "关闭原因"),
    QY053("QY053", "预售计划单据行状态"),
    QY054("QY054", "货源预警的运算结果"),
    QY055("QY055", "紧缺控制的产品类型"),
    QY056("QY056", "审核不通过原因"),
    QY058("QY058", "需求来源类型"),
    QY059("QY059", "渠道类型"),
    QY061("QY061", "紧缺级别"),
    QY079("QY079", "客户经理分类"),
    QY076("QY076", "多业态经营类型"),
    QY077("QY077", "拒绝原因"),
    QY078("QY078", "公告类型"),
    QY080("QY080", "数据来源"),
    QY082("QY082", "账号类型查询"),
    QY083("QY083", "来源类型"),
    QY086("QY086", "主数据分发接口清单"),
    QY090("QY090", "台面材质"),
    SLCM001("SLCM001", "装修性质"),
    SLCM002("SLCM002", "市场类型"),
    SLCM009("SLCM009", "测量人类型"),
    SLCM010("SLCM010", "门店建设整体进度"),
    SLCM019("SLCM019", "图纸设计跟进状态"),
    SLCM003("SLCM003", "装修类型"),
    SLCM004("SLCM004", "装修范围"),
    SLCM006("SLCM006", "异常类型"),
    SLCM012("SLCM012", "图纸紧急程度"),
    SLCM013("SLCM013", "设计范围"),
    SLCM014("SLCM014", "装修进度"),
    SLCM016("SLCM016", "验收进度"),
    SLCM017("SLCM017", "验收类型"),
    SLCM018("SLCM018", "开业状态"),
    SLCM005("SLCM005", "门店建设阶段"),
    SLCM007("SLCM007", "异常变更类型"),
    SLCM008("SLCM008", "测量进度"),
    SLCM011("SLCM011", "图纸设计当前阶段"),
    SLCM020("SLCM020", "整改问题类型"),
    SLCM023("SLCM023", "款式形状"),
    SLCM024("SLCM024", "图纸设计进度"),
    SLCM021("SLCM021", "设计跟进业务类型"),
    SLCM022("SLCM022", "变更类型"),
    SLCM025("SLCM025", "大风格区域"),
    QY092("QY092", "所属品牌"),
    QY094("QY094", "门头类型"),
    QY091("QY091", "床垫软硬度"),
    SLCM027("SLCM027", "营业状态"),
    SLCM028("SLCM028", "店面经理人负责事项"),
    QY089("QY089", "奖惩档案执发部门"),
    QY088("QY088", "奖惩明细"),
    QY087("QY087", "奖惩分类"),
    QY13("QY13", "QY整装类-套件"),
    QY093("QY093", "市场层级"),
    SLCM029("SLCM029", "变更单类型"),
    QY095("QY095", "特殊材质");

    private String code;
    private String name;

    DocTypeEnum(String code, String name) {
        this.code = code;
        this.name = name;
    }

    public String getCode() {
        return code;
    }

    public String getName() {
        return name;
    }

    public static String getName(String code) {
        DocTypeEnum[] values = DocTypeEnum.values();
        for (DocTypeEnum value : values) {
            if (value.code.equals(code)) {
                return value.name;
            }
        }
        return null;
    }
}
